Repository: Pixeval/Pixeval
Catalog: src/Pixeval/Strings/*/LoginPage.resw
Source language: en_us
Languages: fr_fr, ru_ru, zh_cn

# ErrorWhileLoggingInTitle
source: Login process aborted: error occured.
fr_fr: Erreur d'authentification
ru_ru: Ошибка входа в систему
zh_cn: 登录过程出现异常

# ErrorWhileLogginInContentFormatted
source: The app is about to exit, error message： {0}
fr_fr: L'application va quitter. Voici le message d'erreur: {0}
ru_ru: Приложение будет закрыто, вот информация об ошибке: {0}
zh_cn: 应用程序即将退出，以下是异常信息： {0}

# LoginPhaseCheckingCertificateInstallation
source: Checking certificate installation...
ru_ru: Проверка установки сертификата...
zh_cn: 正在检查证书安装情况...

# LoginPhaseCheckingWebView2Installation
source: Ensuring WebView2 installed...
fr_fr: Vérification de WebView2 en cours...
ru_ru: Проверка установки WebView2...
zh_cn: 正在检查WebView2安装情况...

# LoginPhaseInstallingCertificate
source: Installing certificate, please confirm in the dialog...
ru_ru: Установка сертификата, пожалуйста, подтвердите в открывшемся диалоговом окне...
zh_cn: 正在安装证书，请在打开的对话框中点击确认...

# LoginPhaseRefreshing
source: Refreshing session...
fr_fr: Rafraichir la session actuelle en cours...
ru_ru: Обновление сессии...
zh_cn: 正在刷新现有会话...

# LoginPhaseSuccessNavigating
source: Login success, navigating to the welcome page
fr_fr: Authentification avec succès, navigation vers la page d'accueil en cours
ru_ru: Успешный вход, переход на главную страницу
zh_cn: 登录成功，正在导航到主页

# LoginPhaseWaitingForUserInput
source: Waiting for user input
fr_fr: Entrée de l'utilisateur en attente
ru_ru: Ожидание ввода пользователя
zh_cn: 等待用户输入

# SubmitWithNewAccountButton.Text
source: Login with another account
fr_fr: Authentification avec un autre compte
ru_ru: Войти без аккаунта
zh_cn: 登录并且不使用当前账号

# SubmitButton.Content
source: Login
fr_fr: S'authentifier
ru_ru: Войти
zh_cn: 登录

# RefreshTokenButton.Content
source: Login with refresh token
fr_fr: Authentification avec token unique
ru_ru: Войти с обновлением токена
zh_cn: 使用刷新令牌登录

# BrowserButton.Content
source: Login via Chrome/Edge (beta 🧪)
fr_fr: Authentification avec Chrome/Edge (beta🧪)
ru_ru: Войти через Chrome/Edge (тестирование🧪)
zh_cn: 通过用Chrome/Edge浏览器登录（测试🧪）

# WebViewButton.Content
source: Login via Webview
fr_fr: Authentification avec WebView
ru_ru: Войти через WebView
zh_cn: 通过WebView登录

# RefreshTokenBox.PlaceholderText
source: Refresh token
fr_fr: Rafraichir le token
ru_ru: Обновить токен
zh_cn: 刷新令牌

# UserNameBox.PlaceholderText
source: Email or pixiv ID
fr_fr: Addresse email ou ID pixiv
ru_ru: Email или pixiv ID
zh_cn: 邮箱地址或pixiv ID

# PasswordBox.PlaceholderText
source: Password
fr_fr: Mot de passe
ru_ru: Пароль
zh_cn: 密码

# DisableDomainFrontingToggleSwitch.Header
source: Domain fronting
ru_ru: Доменное фронтирование
zh_cn: 域前置

# DisableDomainFrontingToggleSwitch.OnContent
source: Enable
fr_fr: Activer
ru_ru: Включить
zh_cn: 启用

# DisableDomainFrontingToggleSwitch.OffContent
source: Disable
fr_fr: Désactiver
ru_ru: Отключить
zh_cn: 禁用

# RefreshingSessionFailedContent
source: Please login again If this issue recurs, please contact the developer for a solution
zh_cn: 请重新登录 如果该问题反复出现，请联系开发者寻求解决

# RefreshingSessionFailedTitle
source: Failed to refresh session
zh_cn: 刷新对话失败

# FetchingSessionFailedContent
source: Please restart the app If this problem persists, contact the developer for further help.
fr_fr: Veuillez redémarrer l'application Veuillez contacter les développeurs en cas de problème récurrent
ru_ru: Перезапустите приложение Если проблема повторяется, обратитесь к разработчику
zh_cn: 请重新启动应用程序 如果该问题反复出现，请联系开发者寻求解决

# FetchingSessionFailedTitle
source: Failed to fetch session
fr_fr: Récupération de session échouée
ru_ru: Не удалось получить сессию
zh_cn: 获取对话失败

# RootCertificateInstallationRequiredSecondaryButtonText
source: Use Pixeval's certificate
ru_ru: Использовать сертификат Pixeval
zh_cn: 使用Pixeval的证书

# RootCertificateInstallationRequiredPrimaryButtonText
source: Use your own certificate
ru_ru: Использовать собственный сертификат
zh_cn: 使用自己的证书

# CertificateRequiredDialogContent.Text
source: The certificate must be installed in order to login, the private key of this certificate is guaranteed not to be distributed, click "Use Pixeval's certificate" to the installation You can also choose to provide your own valid certificate by entering your certificate path and password in the text box below and selecting "Use your own certificate". If you are still unable to connect to Pixiv after this, you have provided the invalid certificate
ru_ru: Для корректного входа необходимо установить сертификат. Приватный ключ этого сертификата не будет распространяться. Выбор "Использовать сертификат Pixeval" означает, что вы согласны установить данный сертификат. Вы также можете предоставить свой собственный сертификат. Введите путь к сертификату и пароль в текстовом поле ниже и выберите "Использовать собственный сертификат". Если после этого все равно не удастся подключиться к Pixiv, это означает, что сертификат неверен.
zh_cn: 如不安装证书则无法正常登录，本证书的私钥不会被分发，选择“使用Pixeval的证书”即代表您将会安装该证书 你也可以选择自己提供有效的证书，请在下方文本框输入证书路径和密码并选择“使用自己的证书”。如果之后仍无法连接到Pixiv，则说明提供的证书有误

# CertificateRequiredDialogPath.PlaceholderText
source: Certificate path
ru_ru: Путь к сертификату
zh_cn: 证书路径

# CertificateRequiredDialogPassword.PlaceholderText
source: Certificate password
ru_ru: Пароль к сертификату
zh_cn: 证书密码

# CertificateRequiredDialogInvalidInfoBar.Title
source: Incorrect certificate path or password
ru_ru: Неверный путь к сертификату или неправильный пароль
zh_cn: 证书路径错误或密码不正确

# RootCertificateInstallationRequiredTitle
source: You need to install the certificate to login
ru_ru: Требуется установка корневого сертификата
zh_cn: 检测到本用户尚未安装证书

# WebView2InstallationRequiredContent
source: WebView2 is required to log in using this method. By clicking OK the browser will be opened to download the WebView2 Runtime automatically, please restart the app after the installation.
fr_fr: L'utilisation de cette méthode d'authentification nécessite une installation de WebView2, si vous confirmer, le téléchargement de Runtime WebView2 va commencer. Veuillez ensuite l'installer via l'exécution de l'EXE puis relancer l'application.
ru_ru: Для входа этим способом необходимо установить WebView2. Нажмите "ОК", чтобы автоматически открыть браузер и скачать WebView2 Runtime, затем дважды щелкните по exe-файлу для установки и перезапустите приложение.
zh_cn: 使用本方式登录需要安装WebView2，选择确认将会自动打开浏览器为您下载WebView2 Runtime，请您双击exe文件安装后重启应用

# WebViewLoginTip.Title
source: Attention
ru_ru: Внимание
zh_cn: 注意

# WebViewLoginTip.Message
source: WebView2 is required to use this method
fr_fr: Cette méthode nécessite une installation de WebView2
ru_ru: Этот способ требует установки WebView2
zh_cn: 本方式需要安装WebView2

# BrowserLoginTip.Title
source: Attention
ru_ru: Внимание
zh_cn: 注意

# BrowserLoginTip.Message
source: reCAPTCHA may be invisible when using this method
fr_fr: Il se peut que le reCAPTCHA ne soit pas affiché
ru_ru: Этот способ может не показывать reCAPTCHA от Google
zh_cn: 本方式可能不会显示谷歌reCAPTCHA验证码

# WebView2InstallationRequiredTitle
source: WebView2 is required to log in using this method
fr_fr: Il semble que vous n'avez pas d'installation de Runtime WebView2
ru_ru: Не найден WebView2 Runtime на вашем компьютере
zh_cn: 检测到本机尚未安装WebView2 Runtime

# WebViewHelp.ToolTipService.ToolTip
source: WebView2 is required to log in using this method. After you input the account and password, the app will keep it in the local storage Click on the "Login" button will open WebView2 to login automatically，However, if the error occurred while executing the script, or a captcha popped up, you will need to complete the login process manually If you don't trust the app, you can leave the text box empty, click login, and manually fill your credentials in the WebView Domain Fronting：Disabling this will force the app to use the system proxy. If you cannot access Pixiv properly, then it is better not to disable this option.
fr_fr: L'utilisation de cette méthode d'authentification nécessite une installation de WebView2. Votre compte et mot de passe seront enregistrés localement dans Pixeval. L'authentification s'effectuera dès que vous cliquez sur le bouton, avec l'aide de WebView. Vous n'avez rien à faire. Mais il est possible que le script n'arrive pas à exécuter donc vous devrez rentrer des codes de vérification par exemple. Si vous n'avez pas de confiance, vous pouvez toujours les laisser vide et cliquez le bouton d'authentification manuellement, puis entrez vos crédentiels dans le WebView de Pixiv sécurisé. Domain fronting: Vous utiliserez le proxy de votre navigateur par défaut si vous le déactivez. Si vous n'arrivez pas à se connecter sur Pixiv, peut être vous ne devez pas le désactiver.
ru_ru: Этот способ требует установки WebView2. Заполните учетные данные, и программа сохранит их. После нажатия кнопки "Войти" откроется WebView для автоматического входа, без необходимости вмешательства пользователя. Однако, если скрипт не завершится или потребуется ввести капчу, вам придется сделать это вручную. Если вы не доверяете программе сохранение учетных данных, оставьте поля пустыми и введите их вручную в WebView. Доменное фронтирование: отключите это, если не можете напрямую подключиться к Pixiv. Это использует текущие IE-прокси настройки.
zh_cn: 使用本方式登录需要安装WebView2。 填写账号、密码后，软件会一直保存它们 点击“登录”按钮后，会打开WebView进行快速自动登录，全程不需要用户操作，但如果遇到脚本没有执行完毕就停止、或者需要输入验证码的情况，也需要你手动完成 如果你不信任软件帮你保存、填写，也可以直接留空并点击“登录”，然后手动在WebView中输入 域前置：禁用后将使用当前本机的IE代理。如果你此时不能直接访问pixiv，则应该不要禁止此选项

# BrowserHelp.ToolTipService.ToolTip
source: Clicking Login will log you in using an external Chromium kernel browser such as Chrome or Edge. If this method fails, you can use other methods to try to login. Domain fronting: Disabling this will use the current local IE proxy. If you do not have direct access to pixiv at this time, you should not disable this option!
fr_fr: Cliquez le bouton d'Authentification pour s'authentifier avec des navigateurs externs (Chrome/Edge/...), si vous n'arrivez pas à vous authentifier, vous pouvez utiliser d'autres manières de authentification. Domain fronting: Vous utiliserez le proxy de votre navigateur par défaut si vous le déactivez. Si vous n'arrivez pas à se connecter sur Pixiv, peut être vous ne devez pas le désactiver.
ru_ru: Для входа будет использован внешний браузер на основе Chromium (Chrome или Edge). Если этот способ не сработает, попробуйте другие. Доменное фронтирование: отключите это, если не можете напрямую подключиться к Pixiv. Это использует текущие IE-прокси настройки.
zh_cn: 点击登录将使用外部的Chrome或Edge等Chromium内核的浏览器登录。如果此种方法登录失败可以使用其他方法尝试登录 域前置：禁用后将使用当前本机的IE代理。如果你此时不能直接访问pixiv，则应该不要禁止此选项
